fortran/fortran.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Fortran code snippets</title>
<!-- 2016-06-10 Fri 17:20 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Joseph P. McKenna" />
<link rel="stylesheet" type="text/css" href="../css/main.css">
</head>
<body>
<div id="content">
<h1 class="title">Fortran code snippets</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Structure of program</a></li>
<li><a href="#sec-2">2. Computing \({n\choose k}\)</a></li>
<li><a href="#sec-3">3. Setting precision of variables</a></li>
<li><a href="#sec-4">4. Determining Machine Epsilon</a></li>
<li><a href="#sec-5">5. Rootfinding</a></li>
<li><a href="#sec-6">6. Quadrature</a></li>
<li><a href="#sec-7">7. Matrix multiplication</a></li>
<li><a href="#sec-8">8. Summing \(\sum_{n=0}^{\infty}\frac1{n!}\)</a></li>
</ul>
</div>
</div>
<div id="main">

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Structure of program</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">

<pre class="src src-fortran" id="hello_world">program main
  print*, 'hello world'
end program main
</pre>
</div>

<div class="org-src-container">

<pre class="src src-sh">gfortran hello_world.f90 -o hello
./hello
</pre>
</div>

<pre class="example">
hello world
</pre>

<div class="org-src-container">

<pre class="src src-fortran" id="module_template">module header
  implicit none
  ! variable declarations and assignments
  ! interface definitions
contains
  ! function and subroutine definitions
end module header
</pre>
</div>

<div class="org-src-container">

<pre class="src src-fortran" id="program_template">program main
  use constants
  implicit none
  ! variable declarations and assignments
  ! function and subroutine calls
contains
  ! function and subroutine definitions
end program main
</pre>
</div>

<div class="org-src-container">

<pre class="src src-sh" id="compile_template">gfortran -c header.f90
gfortran main.f90 header.o -o executable 
./executable
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Computing \({n\choose k}\)</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">

<pre class="src src-fortran" id="choose">program main
  implicit none
  print*, choose(4,0), choose(4,1), &amp;
       choose(4,2), choose(4,3), choose(4,4)
contains
  function choose(n,k) result(c)
    integer, intent(in) :: n, k
    integer :: c, i
    c = 1
    do i = 1, min(k,n-k)
       c = c * (n-i+1) / i
    end do
  end function choose
end program main
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Setting precision of variables</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">

<pre class="src src-fortran">module constants
  implicit none
  integer, parameter :: sp = kind(0.), dp = kind(0.d0)
  integer, parameter :: rp = dp
end module constants
</pre>
</div>

<div class="org-src-container">

<pre class="src src-sh">gfortran -c precision.f90
</pre>
</div>

<div class="org-src-container">

<pre class="src src-fortran">program main
  use constants
  implicit none
  real(rp) :: x, y
  x = 1._rp
  y = real(1,rp)
end program main
</pre>
</div>

<div class="org-src-container">

<pre class="src src-sh">gfortran main.f90 constants.o -o executable
./executable
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Determining Machine Epsilon</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">

<pre class="src src-fortran">module constants
  implicit none

  integer, parameter :: sp = kind(0.), dp = kind(0.d0)
  integer, parameter :: rp = dp

  interface machine_epsilon
     module procedure machine_epsilon_sp, machine_epsilon_dp
  end interface machine_epsilon

contains

  function machine_epsilon_sp(x) result(e)
    implicit none
    real(sp), intent(in) :: x
    real :: e
    e = .5
    do while (1._sp + e &gt; 1._sp)
       e = .5 * e
    end do
  end function machine_epsilon_sp

  function machine_epsilon_dp(x) result(e)
    implicit none
    real(dp), intent(in) :: x
    real :: e
    e = .5
    do while (1._dp + e &gt; 1._dp)
       e = .5 * e
    end do
  end function machine_epsilon_dp

end module constants
</pre>
</div>

<div class="org-src-container">

<pre class="src src-fortran" id="machine_epsilon">program main
  use constants
  implicit none
  print*, machine_epsilon(0._sp), &amp;
       machine_epsilon(0._dp), &amp;
       machine_epsilon(0._rp)
end program main
</pre>
</div>

<div class="org-src-container">

<pre class="src src-sh">gfortran -c machine_epsilon_module.f90
gfortran machine_epsilon.f90 machine_epsilon_module.o -o machine_epsilon
./machine_epsilon
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Rootfinding</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">

<pre class="src src-fortran">module functions
  implicit none

contains

  function f1(x)
    real, intent(in) :: x
    real :: f1
    f1 = sin(x)
  end function f1

  function df1dx(x)
    real, intent(in) :: x
    real :: df1dx
    df1dx = cos(x)
  end function df1dx

end module functions
</pre>
</div>

<div class="org-src-container">

<pre class="src src-fortran">module rootfinding
  implicit none

  interface
     function fun(x)
       real, intent(in) :: x
       real :: fun
     end function fun
  end interface

contains

  function newton(f,dfdx,x0,tol,maxstep) result(xn)
    procedure(fun), pointer :: f, dfdx
    real, intent(in) :: x0, tol
    integer, intent(in) :: maxstep
    real :: xn
    integer :: n = 0

    xn = x0
    do while (abs(f(xn))&gt;tol .and. n&lt;maxstep)
       xn = xn - f(xn)/dfdx(xn)
       n = n + 1
    end do
  end function newton

end module rootfinding
</pre>
</div>

<div class="org-src-container">

<pre class="src src-fortran">program main
      use functions
  use rootfinding
  implicit none

  procedure(fun), pointer :: f, dfdx
  real :: x = 1., tol = 1e-5
  integer :: maxstep = 100
  f =&gt; f1
  dfdx =&gt; df1dx
  print*, newton(f,dfdx,x,tol,maxstep)

end program main
</pre>
</div>

<div class="org-src-container">

<pre class="src src-sh">gfortran -c rootfind_functions.f90
gfortran -c rootfinding.f90
gfortran rootfind.f90 rootfind_functions.o rootfinding.o -o rootfind
./rootfind
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Quadrature</h2>
<div class="outline-text-2" id="text-6">
<div class="org-src-container">

<pre class="src src-fortran">module functions
  implicit none

contains

  function f1(x)
    real, intent(in) :: x
    real :: f1
    f1 = x
  end function f1

end module functions
</pre>
</div>

<div class="org-src-container">

<pre class="src src-fortran">module quadrature
  implicit none

  interface
     function integrand(x)
       real, intent(in) :: x
       real :: integrand
     end function integrand
  end interface

contains

  function midpoint_rule(f,a,b,n) result(I)
    implicit none
    procedure(integrand), pointer :: f
    real :: a, b
    integer :: n
    real :: I
    I = 0
  end function midpoint_rule

end module quadrature
</pre>
</div>

<div class="org-src-container">

<pre class="src src-fortran">program main
  use functions
  use quadrature
  implicit none

  procedure(integrand), pointer :: f
  real :: a, b
  integer :: n
  f =&gt; f1
  print*, midpoint_rule(f,a,b,n)

end program main
</pre>
</div>

<div class="org-src-container">

<pre class="src src-sh">gfortran -c functions.f90
gfortran -c quadrature.f90
gfortran midpoint.f90 functions.o quadrature.o -o midpoint
./midpoint
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Matrix multiplication</h2>
<div class="outline-text-2" id="text-7">
<div class="org-src-container">

<pre class="src src-fortran" id="matrix_multiplication">program main
  implicit none

  real :: A(4,4), B(4,4)
  A=1; B=2

  print*, matrix_multiply(A,B)

contains

  function matrix_multiply(A,B) result(C)
    implicit none
    real :: A(4,4), B(4,4), C(4,4)
    integer :: i,j,k

    C = 0
    do i=1,4
       do j=1,4
	  do k=1,4
	     C(i,j) = C(i,j) + A(i,k)*B(k,j)
	  end do
       end do
    end do

    end function matrix_multiply

end program main
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Summing \(\sum_{n=0}^{\infty}\frac1{n!}\)</h2>
<div class="outline-text-2" id="text-8">
<div class="org-src-container">

<pre class="src src-fortran" id="series">integer :: n = 1, nf = 1
real :: a, s
do while (1./real(nf) &gt; 0)
	n = n + 1
  nf = nf * n
end do
s = 1./real(nf)
do while (n &gt; 0)
	nf = nf / n
  n = n - 1
  s = s + 1./real(nf)
end do
</pre>
</div>

</div>
</div>
</div>
</div>
</body>
</html>
